// 1) Написать ответ - почему массивы в JS являются "неправильными" и совмещают в себе несколько структур данных? Какие ?
//     2) Привязать контекст объекта к функции logger, чтобы при вызове this.item выводило - some value (Привязать через bind, call, apply)
//
//
// function logger() {
//     console.log(`I output only external context: ${this.item}`);
// }
//
// const obj = { item: "some value" };
//
// 3.1 Массивы:
//
//     - Создайте массив чисел и найдите его сумму.
// - Создайте массив строк и объедините их в одну строку.
// - Найдите максимальный и минимальный элементы в массиве чисел.
//
// 3.2 Stack (стек):
//
// - Реализуйте стек с использованием массива.
//
// 3.3 Queue (очередь):
//
// - Реализуйте очередь с использованием массива.
// - Имитируйте работу очереди на примере ожидания на кассе.
//
//     Бонус задание: Реализовать полифил(собственную функцию реализующую встроенную в js) метода bind()